In [1]:
#Importing Initial Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [79]:
#Importing Excel File
df = pd.read_excel('BengaluruHouseData.xlsx')
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,2023-12-19 00:00:00,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [80]:
df.shape

(13320, 9)

In [81]:
df.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [82]:
df['location'].unique().shape

(1306,)

In [83]:
#Droping unwanted columns
df = df.drop(['area_type','society','availability'], axis=1)
df.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [84]:
df.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [85]:
#Droping rows where location or size column is None
df = df.dropna(subset=['location','size'], axis=0)
df.shape

(13303, 6)

In [77]:
df['bath'].median()

2.0

In [86]:
#Filling None values of bath column with median of bath column
df['bath'].fillna(df['bath'].median(), inplace=True)
df.isnull().sum()

location        0
size            0
total_sqft      0
bath            0
balcony       593
price           0
dtype: int64

In [88]:
#Filling None values of balcony column with 0
df['balcony'].fillna(0, inplace=True)
df.describe()

               bath       balcony         price
count  13303.000000  13303.000000  13303.000000
mean       2.689619      1.513719    112.584033
std        1.339393      0.863189    148.993820
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [91]:
df['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [92]:
#cleaning size column and creating new bhk column
df['bhk'] = df['size'].apply(lambda x: int(x.split(' ')[0]))
df.head()

                   location       size total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00    2

In [96]:
#Drop size column
df.drop('size', axis=1, inplace=True)
df.head()

                   location total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi       2600   5.0      3.0  120.00    4
2               Uttarahalli       1440   2.0      3.0   62.00    3
3        Lingadheeranahalli       1521   3.0      1.0   95.00    3
4                  Kothanur       1200   2.0      1.0   51.00    2

In [97]:
df['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [99]:
df[df['bhk'] > 20]

                       location total_sqft  bath  balcony  price  bhk
1718  2Electronic City Phase II       8000  27.0      0.0  230.0   27
4684                Munnekollal       2400  40.0      0.0  660.0   43

In [100]:
df['total_sqft'].unique()

array([1056, 2600, 1440, ..., '1133 - 1384', 774, 4689], dtype=object)

In [101]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [102]:
df[~df['total_sqft'].apply(is_float)]

                 location   total_sqft  bath  balcony    price  bhk
30              Yelahanka  2100 - 2850   4.0      0.0  186.000    4
56            Devanahalli  3010 - 3410   2.0      0.0  192.000    4
81            Hennur Road  2957 - 3450   2.0      0.0  224.500    4
122                Hebbal  3067 - 8156   4.0      0.0  477.000    4
137    8th Phase JP Nagar  1042 - 1105   2.0      0.0   54.005    2
...                   ...          ...   ...      ...      ...  ...
12990      Talaghattapura  1804 - 2273   3.0      0.0  122.000    3
13059              Harlur  1200 - 1470   2.0      0.0   72.760    2
13240         Devanahalli  1020 - 1130   2.0      0.0   52.570    1
13265               Hoodi  1133 - 1384   2.0      0.0   59.135    2
13299          Whitefield  2830 - 2882   5.0      0.0  154.500    4

[239 rows x 6 columns]

In [112]:
# Defining a function to convert range value into average of range
def convert_sqft_to_num(x):
    if type(x) != int:
        token = x.split('-')
        if len(token == 2):
            return (float(token[0])+float(token[1]))/2
    try:
        return float(x)
    except:
        return None

In [113]:
df['total_sqft'] = df['total_sqft'].apply(convert_sqft_to_num)
df.head(10)

TypeError: object of type 'bool' has no len()